
* R1 index
:PROPERTIES:
:max-ref:  R1
:ID:       23d78832-af74-40b8-9062-0965a25053e6
:prev-line-count: 1
:END:


Extracted some stats
#+begin_src shell :exports both
microfts info -grams index >grams.txt
#+end_src
  
I used this to create index
#+BEGIN_SRC sh :results raw drawer :exports both
for f in $(find . -name "*.org"); do
    echo "#+INCLUDE: " $f
done
#+END_SRC

#+RESULTS:
:results:

:end:


#+INCLUDE:  ./dynabench/api/builder/README.md.org
#+INCLUDE:  ./dynabench/api/evaluation/instructions.md.org
#+INCLUDE:  ./dynabench/api/cron/README.md.org
#+INCLUDE:  ./dynabench/api/templates/decen_dataperf/outdir/README.md.org
#+INCLUDE:  ./dynabench/api/templates/decen_dataperf/selection_algorithm/README.md.org
#+INCLUDE:  ./dynabench/api/templates/decen_dataperf/README.md.org
#+INCLUDE:  ./dynabench/api/templates/decen_dataperf/results/README.md.org
#+INCLUDE:  ./dynabench/api/templates/decen_dataperf/submissions/README.md.org
#+INCLUDE:  ./dynabench/docs/email.md.org
#+INCLUDE:  ./dynabench/docs/frontend.md.org
#+INCLUDE:  ./dynabench/docs/start.md.org
#+INCLUDE:  ./dynabench/docs/database.md.org
#+INCLUDE:  ./dynabench/docs/owners.md.org
#+INCLUDE:  ./dynabench/docs/overview.md.org
#+INCLUDE:  ./dynabench/docs/adding_task.md.org
#+INCLUDE:  ./dynabench/docs/evaluation.md.org
#+INCLUDE:  ./dynabench/CONTRIBUTING.md.org
#+INCLUDE:  ./dynabench/README.md.org
#+INCLUDE:  ./dynabench/legacy/mlcube/vision_data_selection/README.md.org
#+INCLUDE:  ./dynabench/legacy/mlcube/speech_data_selection/README.md.org
#+INCLUDE:  ./dynabench/legacy/torchserve/README.md.org
#+INCLUDE:  ./dynabench/legacy/education/Readme.md.org
#+INCLUDE:  ./dynabench/legacy/modelservers/nli/README.md.org
#+INCLUDE:  ./dynabench/CODE_OF_CONDUCT.md.org
#+INCLUDE:  ./dynabench/backend/app/domain/services/builder_and_evaluation/readme.md.org
#+INCLUDE:  ./dynabench/backend/dynalab/readme.md.org
#+INCLUDE:  ./dynabench/backend/dynalab/example/README.md.org
#+INCLUDE:  ./dynabench/backend/dynalab/example/base-model-nli/README.md.org
#+INCLUDE:  ./peoples-speech/scripts/archive.org
#+INCLUDE:  ./power-dev/CONTRIBUTING.md.org
#+INCLUDE:  ./power-dev/LICENSE.md.org
#+INCLUDE:  ./power-dev/power_meter_sampling/README.md.org
#+INCLUDE:  ./power-dev/README.md.org
#+INCLUDE:  ./power-dev/compliance/README.md.org
#+INCLUDE:  ./power-dev/ptd_client_server/README.md.org
#+INCLUDE:  ./power-dev/log_parsers/README.md.org
#+INCLUDE:  ./power-dev/INSTALL.md.org
#+INCLUDE:  ./croissant/wizard/README.md.org
#+INCLUDE:  ./croissant/docs/howto/readme.md.org
#+INCLUDE:  ./croissant/docs/howto/specify-splits.md.org
#+INCLUDE:  ./croissant/docs/definitions/index.md.org
#+INCLUDE:  ./croissant/docs/definitions/split.md.org
#+INCLUDE:  ./croissant/docs/definitions/validation_split.md.org
#+INCLUDE:  ./croissant/docs/definitions/testing_split.md.org
#+INCLUDE:  ./croissant/docs/definitions/training_split.md.org
#+INCLUDE:  ./croissant/docs/definitions/sitemap.md.org
#+INCLUDE:  ./croissant/docs/croissant-spec.md.org
#+INCLUDE:  ./croissant/CONTRIBUTING.md.org
#+INCLUDE:  ./croissant/LICENSE.md.org
#+INCLUDE:  ./croissant/python/mlcroissant/README.md.org
#+INCLUDE:  ./croissant/python/openmlconverter/README.md.org
#+INCLUDE:  ./croissant/README.md.org
#+INCLUDE:  ./croissant/datasets/README.md.org
#+INCLUDE:  ./algorithmic-efficiency/CHANGELOG.md.org
#+INCLUDE:  ./algorithmic-efficiency/CONTRIBUTING.md.org
#+INCLUDE:  ./algorithmic-efficiency/README.md.org
#+INCLUDE:  ./algorithmic-efficiency/reference_algorithms/target_setting_algorithms/README.md.org
#+INCLUDE:  ./algorithmic-efficiency/datasets/README.md.org
#+INCLUDE:  ./algorithmic-efficiency/getting_started.md.org
#+INCLUDE:  ./algorithmic-efficiency/RULES.md.org
#+INCLUDE:  ./algorithmic-efficiency/baselines/README.md.org
#+INCLUDE:  ./training_policies/CONTRIBUTING.md.org
#+INCLUDE:  ./training_policies/LICENSE.md.org
#+INCLUDE:  ./training_policies/README.md.org
#+INCLUDE:  ./inference/calibration/BraTS/README.md.org
#+INCLUDE:  ./inference/calibration/KiTS/README.md.org
#+INCLUDE:  ./inference/calibration/LibriSpeech/README.md.org
#+INCLUDE:  ./inference/calibration/SQuAD-v1.1/README.md.org
#+INCLUDE:  ./inference/calibration/CriteoTerabyte/README.md.org
#+INCLUDE:  ./inference/calibration/ImageNet/README.md.org
#+INCLUDE:  ./inference/recommendation/dlrm_v2/pytorch/README.md.org
#+INCLUDE:  ./inference/recommendation/dlrm/pytorch/README.md.org
#+INCLUDE:  ./inference/recommendation/dlrm/tf/README.md.org
#+INCLUDE:  ./inference/CONTRIBUTING.md.org
#+INCLUDE:  ./inference/LICENSE.md.org
#+INCLUDE:  ./inference/README.md.org
#+INCLUDE:  ./inference/loadgen/tests/README.md.org
#+INCLUDE:  ./inference/loadgen/demos/lon/README.md.org
#+INCLUDE:  ./inference/loadgen/README_BUILD.md.org
#+INCLUDE:  ./inference/loadgen/docs/src/README.md.org
#+INCLUDE:  ./inference/loadgen/README_FAQ.md.org
#+INCLUDE:  ./inference/loadgen/README.md.org
#+INCLUDE:  ./inference/loadgen/benchmark/README.md.org
#+INCLUDE:  ./inference/speech_recognition/rnnt/README_cm.md.org
#+INCLUDE:  ./inference/speech_recognition/rnnt/optional_harness_ck/README.md.org
#+INCLUDE:  ./inference/speech_recognition/rnnt/README.md.org
#+INCLUDE:  ./inference/vision/medical_imaging/3d-unet-kits19/README_cm.md.org
#+INCLUDE:  ./inference/vision/medical_imaging/3d-unet-kits19/README.md.org
#+INCLUDE:  ./inference/vision/medical_imaging/3d-unet-brats19/README.md.org
#+INCLUDE:  ./inference/vision/classification_and_detection/README_cm_resnet50.md.org
#+INCLUDE:  ./inference/vision/classification_and_detection/README_cm_retinanet.md.org
#+INCLUDE:  ./inference/vision/classification_and_detection/README.md.org
#+INCLUDE:  ./inference/vision/classification_and_detection/tools/retinanet_pytorch_to_onnx.md.org
#+INCLUDE:  ./inference/compliance/nvidia/README.md.org
#+INCLUDE:  ./inference/compliance/nvidia/TEST04/README.md.org
#+INCLUDE:  ./inference/compliance/nvidia/TEST01/README.md.org
#+INCLUDE:  ./inference/compliance/nvidia/TEST05/README.md.org
#+INCLUDE:  ./inference/tools/githooks/README.md.org
#+INCLUDE:  ./inference/tools/submission/README.md.org
#+INCLUDE:  ./inference/tools/upscale_coco/README.md.org
#+INCLUDE:  ./inference/translation/gnmt/README.md.org
#+INCLUDE:  ./inference/translation/gnmt/tensorflow/README.md.org
#+INCLUDE:  ./inference/language/bert/README_cm.md.org
#+INCLUDE:  ./inference/language/bert/README.md.org
#+INCLUDE:  ./inference/language/gpt-j/README_cm.md.org
#+INCLUDE:  ./inference/language/gpt-j/README.md.org
#+INCLUDE:  ./inference/language/gpt-j/DATASETS_MODELS.md.org
#+INCLUDE:  ./inference/Submission_Guidelines.md.org
#+INCLUDE:  ./mobile_models/v1_0/tflite/README.md.org
#+INCLUDE:  ./mobile_models/v1_0/SNPE/INDEPENDENT_WORK.md.org
#+INCLUDE:  ./mobile_models/v1_0/assets/README.md.org
#+INCLUDE:  ./mobile_models/CONTRIBUTING.md.org
#+INCLUDE:  ./mobile_models/v1_1/tflite/README.md.org
#+INCLUDE:  ./mobile_models/LICENSE.md.org
#+INCLUDE:  ./mobile_models/README.md.org
#+INCLUDE:  ./mobile_models/v3_0/datasets/READMDE.md.org
#+INCLUDE:  ./mobile_models/v3_0/assets/README.md.org
#+INCLUDE:  ./mobile_models/v0_7/tflite/README.md.org
#+INCLUDE:  ./mobile_models/v0_7/SNPE/INDEPENDENT_WORK.md.org
#+INCLUDE:  ./mobile_models/v0_7/README.md.org
#+INCLUDE:  ./ck/docs/news-mlperf-v3.1.md.org
#+INCLUDE:  ./ck/docs/introduction-ck.md.org
#+INCLUDE:  ./ck/docs/list_of_scripts.md.org
#+INCLUDE:  ./ck/docs/specs/cm-repository.md.org
#+INCLUDE:  ./ck/docs/specs/README.md.org
#+INCLUDE:  ./ck/docs/specs/cm-tool-architecture.md.org
#+INCLUDE:  ./ck/docs/specs/cm-automation-script.md.org
#+INCLUDE:  ./ck/docs/specs/cm-python-interface.md.org
#+INCLUDE:  ./ck/docs/specs/cm-cli.md.org
#+INCLUDE:  ./ck/docs/installation.md.org
#+INCLUDE:  ./ck/docs/interface.md.org
#+INCLUDE:  ./ck/docs/introduction-cm.md.org
#+INCLUDE:  ./ck/docs/installation-cuda.md.org
#+INCLUDE:  ./ck/docs/taskforce.md.org
#+INCLUDE:  ./ck/docs/README.md.org
#+INCLUDE:  ./ck/docs/news.md.org
#+INCLUDE:  ./ck/docs/mlperf-cm-automation-demo.md.org
#+INCLUDE:  ./ck/docs/mlperf/setup/setup-nvidia-jetson-orin.md.org
#+INCLUDE:  ./ck/docs/mlperf/setup/setup-aws-instance.md.org
#+INCLUDE:  ./ck/docs/mlperf/setup/setup-gcp-instance.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/README_collabora.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/retinanet/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/retinanet/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/retinanet/README_nvidia.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/README_a100.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/dlrm_v2/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/bert/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/bert/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/bert/README_deepsparse.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/bert/README_nvidia.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/bert/README_intel.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/bert/tutorial.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/rnnt/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/rnnt/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/rnnt/README_nvidia.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/gpt-j/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/gpt-j/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/Submission.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/resnet50/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/resnet50/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/resnet50/README_nvidia.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/resnet50/README_tflite.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/3d-unet/README_reference.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/3d-unet/README.md.org
#+INCLUDE:  ./ck/docs/mlperf/inference/3d-unet/README_nvidia.md.org
#+INCLUDE:  ./ck/docs/mlperf/README.md.org
#+INCLUDE:  ./ck/docs/faq.md.org
#+INCLUDE:  ./ck/docs/debugging.md.org
#+INCLUDE:  ./ck/docs/tutorials/mlperf-inference-power-measurement.md.org
#+INCLUDE:  ./ck/docs/tutorials/concept.md.org
#+INCLUDE:  ./ck/docs/tutorials/automate-mlperf-tiny.md.org
#+INCLUDE:  ./ck/docs/tutorials/sc22-scc-mlperf.md.org
#+INCLUDE:  ./ck/docs/tutorials/modular-image-classification.md.org
#+INCLUDE:  ./ck/docs/tutorials/README.md.org
#+INCLUDE:  ./ck/docs/tutorials/test-spec-ptdaemon.md.org
#+INCLUDE:  ./ck/docs/tutorials/scc23-mlperf-inference-bert.md.org
#+INCLUDE:  ./ck/docs/tutorials/reproduce-mlperf-training.md.org
#+INCLUDE:  ./ck/docs/tutorials/sc22-scc-mlperf-part3.md.org
#+INCLUDE:  ./ck/docs/tutorials/sc22-scc-mlperf3.md.org
#+INCLUDE:  ./ck/docs/tutorials/mlperf-language-processing.md.org
#+INCLUDE:  ./ck/docs/tutorials/common-interface-to-reproduce-research-projects.md.org
#+INCLUDE:  ./ck/docs/tutorials/sc22-scc-mlperf-part2.md.org
#+INCLUDE:  ./ck/docs/tutorials/reproduce-mlperf-tiny.md.org
#+INCLUDE:  ./ck/docs/tutorials/scripts.md.org
#+INCLUDE:  ./ck/docs/tutorials/reproduce-research-paper-ipol.md.org
#+INCLUDE:  ./ck/docs/tutorials/mlperf-inference-submission.md.org
#+INCLUDE:  ./ck/docs/tutorials/sc22-scc-mlperf2.md.org
#+INCLUDE:  ./ck/docs/list_of_automations.md.org
#+INCLUDE:  ./ck/docs/misc/history.md.org
#+INCLUDE:  ./ck/docs/misc/ML.md.org
#+INCLUDE:  ./ck/docs/misc/MLOps.md.org
#+INCLUDE:  ./ck/docs/misc/overview.md.org
#+INCLUDE:  ./ck/docs/archive/taskforce-2022.md.org
#+INCLUDE:  ./ck/docs/artifact-evaluation/hotcrp-config/README.md.org
#+INCLUDE:  ./ck/docs/artifact-evaluation/reviewing.md.org
#+INCLUDE:  ./ck/docs/artifact-evaluation/submission.md.org
#+INCLUDE:  ./ck/docs/artifact-evaluation/checklist.md.org
#+INCLUDE:  ./ck/docs/artifact-evaluation/faq.md.org
#+INCLUDE:  ./ck/docs/mlperf-education-workgroup.md.org
#+INCLUDE:  ./ck/cm/docs/tutorial-concept.md.org
#+INCLUDE:  ./ck/cm/docs/installation.md.org
#+INCLUDE:  ./ck/cm/docs/example-modular-image-classification.md.org
#+INCLUDE:  ./ck/cm/docs/README.md.org
#+INCLUDE:  ./ck/cm/docs/conventions.md.org
#+INCLUDE:  ./ck/cm/docs/tutorial-scripts.md.org
#+INCLUDE:  ./ck/cm/docs/tutorial-modular-mlperf.md.org
#+INCLUDE:  ./ck/cm/docs/specification.md.org
#+INCLUDE:  ./ck/cm/docs/motivation.md.org
#+INCLUDE:  ./ck/cm/docs/KB/ML.md.org
#+INCLUDE:  ./ck/cm/docs/KB/MLOps.md.org
#+INCLUDE:  ./ck/cm/docs/architecture.md.org
#+INCLUDE:  ./ck/cm/docs/enhancements.md.org
#+INCLUDE:  ./ck/cm/CONTRIBUTING.md.org
#+INCLUDE:  ./ck/cm/LICENSE.md.org
#+INCLUDE:  ./ck/cm/LICENSE.CK.md.org
#+INCLUDE:  ./ck/cm/CHANGES.md.org
#+INCLUDE:  ./ck/cm/README.md.org
#+INCLUDE:  ./ck/cm/cmind/repo/automation/automation/README.md.org
#+INCLUDE:  ./ck/cm/cmind/repo/automation/automation/template_list_of_automations.md.org
#+INCLUDE:  ./ck/cm/cmind/repo/automation/ck/README.md.org
#+INCLUDE:  ./ck/cm/cmind/repo/automation/core/README.md.org
#+INCLUDE:  ./ck/cm/cmind/repo/automation/repo/README.md.org
#+INCLUDE:  ./ck/cm/cmind/repo/README.md.org
#+INCLUDE:  ./ck/CONTRIBUTING.md.org
#+INCLUDE:  ./ck/LICENSE.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/task-speech-recognition.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/task-recommendation.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/task-object-detection.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/task-image-classification.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/task-nlp.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks-custom/task-medical-imaging.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tbd/ck2.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tbd/automation.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tbd/standardization.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/models/notes-convert-resnet50-onnx-format-to-quantized-tensorrt-engine.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/models/notes.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/models/notes-convert-tf-resnet50-1.5-to-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/models/notes-using-tflite-models-for-datacenter-scenarios.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-ae88dc4516a7084e.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-object-detection-rpi4-coral-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-3e0ad4b09998375d.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-object-detection-x86-64-docker.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-a399f837b48b0d1b.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-b14c70816eca59c6.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-mlperf-inf-1.1-image-classification-resnet50-aws-c6gd.xlarge-arm64-edge-closed.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-object-detection-rpi4-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-1b165548d8adbe4d.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-4f1a470a8a034bc3.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-image-classification-x86-64-tflite2.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-image-classification-x86-64-openvino-2019.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-c3d81b4b869e8e07.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-image-classification-rpi4-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-mlperf-inf-1.1-image-classification-resnet50-rpi4-arm64-edge-closed.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-94cc7bdd1f23cce3.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-object-detection-x86-64.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/demo-webcam-object-detection-x86-64.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/image-classification-nvidia-jetson-xavier-mlperf.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-image-classification-x86-64-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-image-classification-x86-64-docker.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-image-classification-jetson-nano-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-6582273dd3646e28.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-9fb65e57d8c61db4.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-mlperf-inf-1.1-image-classification-dse-pareto-mobilenet-v1-0.25-224-quantized-tflite-aws-c6gd.xlarge-neoverse-n1-edge-open.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/reproduce/ck-3c77b273b4c7d878.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/framework-pytorch.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/framework-onnx.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/common.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/framework-tvm.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/lib-transformers.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/compiler-cuda.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/framework-tf.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/setup/framework-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/inference/workflow.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/inference/containers.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/inference/notes.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/submit/power.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/submit/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/rpi4-ubuntu.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/nvidia-generic.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/nvidia-jetson-nano.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/rpi4-debian.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/x8664-yocto.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/rpi4-coral-ubuntu.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/platform/x8664-ubuntu.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/results/ck-dashboard.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/results/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/imagenet2012.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/coco2017-preprocess.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/coco2017.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/imagenet2012-preprocess.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/librispeech.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/squad.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/datasets/brats2019.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/dse/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-object-speech-pytorch.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-speech-recognition.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-medical-imaging-pytorch.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/tvm/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/tvm/mlperf-object-detection.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/tvm/mlperf-image-classification.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification-tf.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-object-detection-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-object-detection-onnx.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-recommendation.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-object-detection-tensorrt.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-language-onnx.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-object-detection.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-medical-imaging-onnx.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification-tvm.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification-openvino.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-nlp.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification-pytorch.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-object-detection-tvm.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification-onnx.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tasks/task-image-classification-tflite.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/ck.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/logging.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/mlcube.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/ck-venv.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/continuous-integration.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tools/ck-docker.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tutorials/mlperf-inference-v1.1-submission-demo.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tutorials/tvmcon-2021-automating-mlperf-with-tvm-and-ck.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tutorials/README.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/tutorials/tvmcon-2021-automating-mlperf-with-tvm-and-ck-demo.md.org
#+INCLUDE:  ./ck/ck/docs/mlperf-automation/components/README.md.org
#+INCLUDE:  ./ck/ck/docs/src/typical-usage.md.org
#+INCLUDE:  ./ck/ck/docs/src/commands.md.org
#+INCLUDE:  ./ck/ck/docs/src/misc.md.org
#+INCLUDE:  ./ck/ck/docs/src/installation.md.org
#+INCLUDE:  ./ck/ck/docs/src/introduction.md.org
#+INCLUDE:  ./ck/ck/docs/src/acknowledgments.md.org
#+INCLUDE:  ./ck/ck/docs/src/use-cases.md.org
#+INCLUDE:  ./ck/ck/docs/src/portable-workflows.md.org
#+INCLUDE:  ./ck/ck/docs/src/first-steps.md.org
#+INCLUDE:  ./ck/ck/docs/src/how-to-contribute.md.org
#+INCLUDE:  ./ck/ck/docs/src/specs.md.org
#+INCLUDE:  ./ck/ck/docs/src/feedback.md.org
#+INCLUDE:  ./ck/ck/CONTRIBUTING.md.org
#+INCLUDE:  ./ck/ck/LICENSE.md.org
#+INCLUDE:  ./ck/ck/ck/repo/module/result/README.md.org
#+INCLUDE:  ./ck/ck/ck/repo/module/dashboard/README.md.org
#+INCLUDE:  ./ck/ck/ck/repo/module/ck-platform/README.md.org
#+INCLUDE:  ./ck/ck/ck/repo/module/graph/third-party/d3/README.md.org
#+INCLUDE:  ./ck/ck/README.md.org
#+INCLUDE:  ./ck/ck/incubator/ck-lite/README.md.org
#+INCLUDE:  ./ck/ck/incubator/cdatabase/CONTRIBUTING.md.org
#+INCLUDE:  ./ck/ck/incubator/cdatabase/README.md.org
#+INCLUDE:  ./ck/ck/incubator/README.md.org
#+INCLUDE:  ./ck/ck/incubator/cbench/README.md.org
#+INCLUDE:  ./ck/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/repro-mlperf-inf-v3.0-orin/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1--tournament/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-universal-cpp-implementation-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/train-llm-for-cm-mlperf-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/repro-mlperf-inference-retinanet-scc2022/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/reproduce-and-automate-neurips-2022-paper-arxiv-2204.09656/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-modular-mojo-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-google-tpu-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-create-end-to-end-app/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/run-mlperf@home-v3.1-gpu/run-nvidia-gpu-bert-99-nvidia-docker-tensorrt.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/run-mlperf@home-v3.1-gpu/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/run-mlperf@home-v3.1-gpu/run-nvidia-gpu-gpt-j-6b-ref-pytorch.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-android/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/reproduce-mlperf-training-v3.0-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v2.1-2022/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/participate-hipeac-reproducibilty-challenge-2024/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-hugging-face-models-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/run-mlperf@home-v3.1-cpu/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/run-mlperf@home-v3.1-cpu/run-cpu-dse-mobilenets-efficientnets-tflite.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/run-mlperf@home-v3.1-cpu/run-cpu-bert-99-deepsparse.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/reproduce-and-automate-tinymlperf-v1.1-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-scc2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/connect-mlperf-with-medperf/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/connect-mlperf-inference-v3.1-with-openbenchmarking/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/repro-micro2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/reproduce-and-automate-ipol-paper/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-amazon-inferentia-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/setup-nvidia-jetson-orin.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/crowd-benchmark-mlperf-bert-inference-cuda.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/generate-rnnt-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/generate-retinanet-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/setup-aws-instance.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/generate-resnet50-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/generate-3d-unet-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/setup-gcp-instance.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/docs/generate-bert-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.0-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-tvm-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-windows-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/reproduce-automate-explain-past-mlperf-inference-results-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-intel-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-qualcomm-ai100-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/add-derived-metrics-to-mlperf-inference-v3.1/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/setup-nvidia-jetson-orin.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/generate-rnnt-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/generate-retinanet-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/setup-aws-instance.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/generate-resnet50-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/generate-3d-unet-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/setup-gcp-instance.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/docs/generate-bert-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-2023/README.md.org
#+INCLUDE:  ./ck/cm-mlops/challenge/optimize-mlperf-inference-v3.1-deepsparse/README.md.org
#+INCLUDE:  ./ck/cm-mlops/CONTRIBUTING.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/challenge/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/list_of_scripts.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/docker/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/cache/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/cache/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/utils/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/contributor/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/report/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/experiment/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/experiment/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/template-pytorch/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/template-ae-python/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/README-specs.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/README.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/template_list_of_scripts.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/template/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/script/template-python/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/automation/project/README.md.org
#+INCLUDE:  ./ck/cm-mlops/LICENSE.md.org
#+INCLUDE:  ./ck/cm-mlops/CHANGES.md.org
#+INCLUDE:  ./ck/cm-mlops/README.md.org
#+INCLUDE:  ./ck/cm-mlops/LICENSE.third-party.md.org
#+INCLUDE:  ./ck/cm-mlops/report/mlperf-inference-v3.1-analysis-ctuning/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-dockerfile/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-dockerfile/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-onnxruntime-prebuilt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cudnn/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/push-csv-to-spreadsheet/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-retinanet/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-retinanet/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-experiment-to-sqlite/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-sys-utils-min/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-gptj/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/test-set-sys-user-cm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-micro-paper-2023-victima/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-micro-paper-2023-victima/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/convert-ml-model-huggingface-to-onnx/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-training-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-training-src/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ck/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-sut-configs/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-sut-configs/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ck-repo-mlops/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-xilinx-sdk/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-nvidia-scratch-space/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-nvidia-scratch-space/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-openimages-annotations/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-sut-description/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dlrm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dlrm/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-efficientnet-lite/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/detect-sudo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-tvm-model/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-tvm-model/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-bert-base-squad/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-cmake-prebuilt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-bazel/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-mlperf-training-nvidia/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-terraform/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-terraform/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-terraform/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-tensorflow-from-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-gflags/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-power-dev/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-power-dev/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-retinanet-nvidia/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-openssl/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-bert-squad-vocab/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/remote-run-commands/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/remote-run-commands/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-terraform-from-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-squad-vocab/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-aocl/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-aocl/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/prepare-training-data-bert/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-3d-unet-kits19/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-tvm-onnx-py/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-tvm-onnx-py/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/upgrade-python-pip/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/process-mlperf-accuracy/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-reference/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-reference/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-reference/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cuda/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cuda/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cuda/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-loadgen-generic-python/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-loadgen-generic-python/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/download-and-extract/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-bert-large-squad/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-go/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-go/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-mlperf-training-to-experiment/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-mlperf-training-to-experiment/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-java/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-java/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-lib-armnn/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-spec-ptd/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-spec-ptd/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-python/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-zephyr/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-zephyr/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-torch-py/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-torch-py/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-dlrm-terabyte/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-generic-sys-util/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/detect-os/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-tf-onnx-cpp/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-tf-onnx-cpp/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-all-mlperf-models/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/publish-results-to-dashboard/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-aws-cli/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/preprocess-mlperf-inference-submission/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-tensorflow-for-c/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/wrapper-reproduce-octoml-tinyml-submission/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/wrapper-reproduce-octoml-tinyml-submission/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-librispeech/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-librispeech/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/create-fpgaconvnet-config-tinyml/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-blis/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-blis/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-docker-image/examples/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-docker-image/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-docker-image/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-tiny-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-nvidia-common-code/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-nvidia-common-code/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/detect-cpu/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/detect-cpu/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-tflite-from-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-tensorrt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-tensorrt/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-compiler-flags/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-loadgen/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-loadgen/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/pull-git-repo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-kits19/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/process-ae-users/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cl/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cl/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-openimages/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-github-cli/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/flash-tinyml-binary/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/flash-tinyml-binary/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-app/modular-cm-containers/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-app/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-app/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-app/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/compile-program/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/compile-program/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/add-custom-nvidia-system/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/add-custom-nvidia-system/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ipol-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/set-echo-off-win/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-nvidia/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-nvidia/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-cpp/CONTRIBUTING.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-cpp/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-cpp/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-lib-dnnl/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-resnet50/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-resnet50/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/print-hello-world-java/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-llvm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-llvm/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/activate-python-venv/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/activate-python-venv/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cmsis_5/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cmsis_5/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-micro-paper-2023-xyz/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-openimages/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-openimages/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-python-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cmake/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/test-download-and-extract-artifacts/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/test-download-and-extract-artifacts/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-corner-detection/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-corner-detection/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/test-mlperf-inference-retinanet-win/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-ipol-paper-2022-439/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-ipol-paper-2022-439/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference-tflite-cpp/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-android-sdk/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-android-sdk/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-cuda-devices/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-python-venv/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-docker-container/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-docker-container/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-inference-submission/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-inference-submission/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-inference-submission/default_files/analyzer_table.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-inference-submission/default_files/power_settings.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-rnnt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-submission-checker/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-submission-checker/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/download-torrent/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-generic-python-lib/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-generic-python-lib/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/prepare-training-data-resnet/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-onnx-py/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-image-classification-onnx-py/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-rclone/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/download-file/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-mobilenet/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-mobilenet/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-mobilenet-models/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-inference-mobilenet-models/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-training-submission-checker/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-huggingface-zoo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-qaic-software-kit/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-power-client/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-power-client/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-imagenet-helper/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/print-python-version/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/print-hello-world-py/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/create-fpgaconvnet-app-tinyml/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-tvm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-tvm/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-compiler-rust/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/truncate-mlperf-inference-accuracy-log/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/truncate-mlperf-inference-accuracy-log/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-imagenet-train/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-inference-user-conf/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-nvidia-engine/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-nvidia-engine/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-zephyr-sdk/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-zephyr-sdk/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-zendnn/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-mlperf-inference-to-experiment/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-mlperf-inference-to-experiment/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-mlperf-octoml-tinyml-results/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-mlperf-octoml-tinyml-results/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-criteo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-criteo/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/print-hello-world/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/print-hello-world-javac/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-kilt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-kilt/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/set-sqlite-dir/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-training-nvidia-code/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-cifar10/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-brew/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-microtvm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-microtvm/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-logging/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-logging/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-nvidia-docker/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-imagenet-val/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-imagenet-val/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-javac/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-javac/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-cuda-package-manager/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-squad/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-squad/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-qaic-compute-sdk/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-power-server/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/run-mlperf-power-server/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/push-mlperf-inference-results-to-github/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-src/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-openssl/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-openssl/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-git-repo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-git-repo/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-tiny-report/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-tiny-report/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/extract-file/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-kits19/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-mlperf-inference-nvidia/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/reproduce-mlperf-inference-nvidia/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/convert-csv-to-md/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/benchmark-program-mlperf/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-tiny-resnet/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-github-cli/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-python3/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-python3/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-training-nvidia/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-cnndm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-mlperf-tiny-to-experiment/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/import-mlperf-tiny-to-experiment/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-mlperf-inference-server-nvidia/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/build-mlperf-inference-server-nvidia/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-imagenet/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-imagenet/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-aws-cli/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-aws-cli/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-cuda-prebuilt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-cuda-prebuilt/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-imagenet-aux/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/tar-my-folder/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/tar-my-folder/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-llvm-prebuilt/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-llvm-prebuilt/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/prune-bert-models/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/prune-bert-models/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-gcc-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-using-imagenet-from-model-zoo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-tiny-submission/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/generate-mlperf-tiny-submission/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/benchmark-program/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference/dockerfiles/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-inference/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-librispeech/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-preprocessed-dataset-generic/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-tiny-eembc-energy-runner-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/set-performance-mode/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-sys-utils-cm/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-docker/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-results/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-mlperf-inference-results/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-bazel/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-bazel/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-ml-model-neuralmagic-zoo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-gcc/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-gcc/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-terraform/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-terraform/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/destroy-terraform/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/destroy-terraform/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/script/install-llvm-src/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/gui/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/gui/README-about.md.org
#+INCLUDE:  ./ck/cm-mlops/script/gui/playground_beta_README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/app-mlperf-training-reference/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-google-test/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-criteo/README.md.org
#+INCLUDE:  ./ck/cm-mlops/script/get-dataset-criteo/README-extra.md.org
#+INCLUDE:  ./ck/cm-mlops/project/mlperf-inference-v3.0-submissions/docs/crowd-benchmark-mlperf-bert-inference-cuda.md.org
#+INCLUDE:  ./ck/cm-mlops/project/mlperf-inference-v3.0-submissions/docs/run-nvidia-implementation.md.org
#+INCLUDE:  ./ck/cm-mlops/project/mlperf-inference-v3.0-submissions/docs/generate-resnet50-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/project/mlperf-inference-v3.0-submissions/docs/generate-bert-submission.md.org
#+INCLUDE:  ./ck/cm-mlops/project/mlperf-inference-v3.0-submissions/docs/setup-aws-graviton.md.org
#+INCLUDE:  ./ck/cm-mlops/project/mlperf-inference-v3.0-submissions/README.md.org
#+INCLUDE:  ./ck/platform/register.md.org
#+INCLUDE:  ./ck/platform/README.md.org
#+INCLUDE:  ./ck/platform/register2.md.org
#+INCLUDE:  ./ck/platform/get-started.md.org




* some of the prep scripts

#+begin_src sh :exports both

find -name \*.org | xargs grep -h . | sort -u > ulines.txt
find -name \*.org | xargs grep -h . | sort |uniq -c | sort -n > clines.txt
tr -s '[[:punct:][:space:]]' '\n'  < ulines.txt  > words.txt
sort uwords.txt |uniq -c | sort -n >wordcounts.txt
find  > files.txt
cat files.txt  | grep -o "\.[A-Za-z][A-Za-z][A-Za-z]$"  | sort |uniq -c | sort -n 
cat files.txt  | grep -o "\.[^\/\.]*$"  | sort |uniq -c | sort -n > all.txt
cat files.txt  | grep "\.md$"  >markdown.txt

#+end_src

* Approach

1. vectorize all unique lines, load into postgres. line and vector.
2. count line occurance, add to table. line and count.
3. for similar counts find co ccurances.  for count >N, find ones in a range of +/- %
   
So take begin_src end_src babel blocks

using emacs org babel mode, write an inline elisp script that traverses the current document and
finds the previous block of data and parses it.

** programming languages
use python to sum the numbers in the following table.
#+begin_src sh :exports both
grep BEGIN_SRC clines.txt 
#+end_src
#+NAME: source-table
#+RESULTS:
|      1 | #+BEGIN_SRC | latex    |          |     |        |
|      1 | #+BEGIN_SRC | sh       | :results | raw | drawer |
|      2 | #+BEGIN_SRC | css      |          |     |        |
|      2 | #+BEGIN_SRC | dot      |          |     |        |
|      2 | #+BEGIN_SRC | python   |          |     |        |
|      2 | #+BEGIN_SRC | sql      |          |     |        |
|      3 | #+BEGIN_SRC | C++      |          |     |        |
|      4 | #+BEGIN_SRC | sh       |          |     |        |
|      8 | #+BEGIN_SRC | sh       |          |     |        |
|      8 | #+BEGIN_SRC | sh       |          |     |        |
|     11 | #+BEGIN_SRC | ruby     |          |     |        |
|     12 | #+BEGIN_SRC | C        |          |     |        |
|     17 | #+BEGIN_SRC | python   |          |     |        |
|     36 | #+BEGIN_SRC | plantuml |          |     |        |
|     48 | #+BEGIN_SRC | java     |          |     |        |
|     77 | #+BEGIN_SRC | sh       |          |     |        |
|    111 | #+BEGIN_SRC | C++      |          |     |        |
|    266 | #+BEGIN_SRC | python   |          |     |        |
|    299 | #+BEGIN_SRC | sh       |          |     |        |
|   1059 | #+BEGIN_SRC | js       |          |     |        |
|   3167 | #+BEGIN_SRC | python   |          |     |        |
| 199711 | #+BEGIN_SRC | sh       |          |     |        |


#+NAME: programming-language-table
#+RESULTS: table-sum
| sh       | 200108 |
| python   |   3452 |
| js       |   1059 |
| C++      |    114 |
| java     |     48 |
| plantuml |     36 |
| C        |     12 |
| ruby     |     11 |
| css      |      2 |
| dot      |      2 |
| sql      |      2 |
| latex    |      1 |

#+NAME: table-sum
#+BEGIN_SRC python :var table=source-table :exports both
  from collections import  Counter
  total = Counter()
  for x in table:
      count=x[0]
      name=x[2]
      total[name] += count
  return total.most_common()
#+END_SRC


#+NAME end-src-data
#+begin_src data
    999: 204161 #+END_SRC
 204949:      4 #+END_SRC
 218872:      8 #+END_SRC
 221571:     10 #+END_SRC
 232290:    319 #+END_SRC
 232313:    345 #+END_SRC
#+end_src
 
4. for variations ignoring whitespace, removed the whitespace differences in the data
   or other changes replace one line with another to fill in missing.
5. construct graph of lines as grammar, treat lines as tokens, tokenize and compare.
6. create windows around lines, create ngrams of lines.
7. tokenize in org mode, and construct json from pandoc.


* Bibliography

@Article{2020,
  author       = {Zaman, Faisal},
  title	       = {Demo 1: Getting Started with TFLite},
  journal      = {TensorFlow Lite for Mobile Development},
  year	       = 2020,
  doi	       = {10.1007/978-1-4842-6666-3_5},
  url	       = {http://dx.doi.org/10.1007/978-1-4842-6666-3_5},
  ISBN	       = 9781484266663,
  publisher    = {Apress}
}

@article{1, (B) second approach-ResNet50, (C) third approach-ResNet50, (D) third approach-ResNet101, (greenwall, blueno-wall)., url={http://dx.doi.org/10.7717/peerj-cs.1565/fig-6}, DOI={10.7717/peerj-cs.1565/fig-6}, publisher={PeerJ} }


tflite https://www.tensorflow.org/litex



https://github.com/ARM-software/armnn
